; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v12 ?v13)
             (pred_11 ?v4 ?v6)
             (pred_10 ?v12 ?v6)
             (pred_5 ?v7 ?v12 )
	     (pred_4 ?v12)
             (pred_7 ?v3)
             (pred_12 ?v4)
             (pred_2 ?v6)
             (pred_8 ?v12)
             (pred_6 ?v4)
             (pred_9 ?v12)
             (pred_3 ))



(:action op_3
:parameters (?v9 ?v10 ?v11 ?v2)
:precondition (and (pred_7 ?v9) (pred_7 ?v10) (pred_12 ?v11) (pred_2 ?v2)
          (pred_1 ?v9 ?v10) (pred_11 ?v11 ?v2)
                   (pred_10 ?v10 ?v2) (pred_4 ?v9) 
                   (pred_8 ?v10) (pred_6 ?v11))
:effect (and  (pred_9 ?v10) (not (pred_8 ?v10))))


(:action op_5
:parameters (?v9 ?v8)
:precondition (and (pred_7 ?v9) (pred_7 ?v8)
               (pred_4 ?v9) (pred_1 ?v9 ?v8) (pred_9 ?v8))
:effect (and (pred_4 ?v8) (not (pred_4 ?v9))))

(:action op_1
:parameters (?v9 ?v11)
:precondition (and (pred_7 ?v9) (pred_12 ?v11) 
                  (pred_4 ?v9) (pred_5 ?v11 ?v9) (pred_3 ))
:effect (and (pred_6 ?v11)
   (not (pred_5 ?v11 ?v9)) (not (pred_3 ))))


(:action op_2
:parameters (?v9 ?v5 ?v1)
:precondition (and (pred_7 ?v9) (pred_12 ?v5) (pred_12 ?v1)
                  (pred_4 ?v9) (pred_6 ?v1) (pred_5 ?v5 ?v9))
:effect (and (pred_6 ?v5) (pred_5 ?v1 ?v9)
        (not (pred_6 ?v1)) (not (pred_5 ?v5 ?v9))))

(:action op_4
:parameters (?v9 ?v11)
:precondition (and (pred_7 ?v9) (pred_12 ?v11) 
                  (pred_4 ?v9) (pred_6 ?v11))
:effect (and (pred_3 ) (pred_5 ?v11 ?v9) (not (pred_6 ?v11)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_10 obj_03 obj_02 obj_09 obj_18 obj_13 obj_01 obj_04 obj_05 obj_07 obj_08 obj_22 obj_19 obj_16 obj_21
    obj_17 obj_15 obj_06
    obj_20 obj_11 obj_12
    )

    (:init
       (pred_3)

       (pred_7 obj_14)
       (pred_7 obj_10)
       (pred_7 obj_03)
       (pred_7 obj_02)
       (pred_7 obj_09)
       (pred_7 obj_18)
       (pred_7 obj_13)
       (pred_7 obj_01)
       (pred_7 obj_04)
       (pred_7 obj_05)
       (pred_7 obj_07)
       (pred_7 obj_08)
       (pred_7 obj_22)
       (pred_7 obj_19)
       (pred_7 obj_16)
       (pred_7 obj_21)
       (pred_2 obj_17)
       (pred_2 obj_15)
       (pred_2 obj_06)
       (pred_12 obj_20)
       (pred_12 obj_11)
       (pred_12 obj_12)

       (pred_1 obj_14 obj_09)
       (pred_1 obj_14 obj_10)
       (pred_1 obj_10 obj_18)
       (pred_1 obj_10 obj_03)
       (pred_1 obj_10 obj_14)
       (pred_1 obj_03 obj_13)
       (pred_1 obj_03 obj_02)
       (pred_1 obj_03 obj_10)
       (pred_1 obj_02 obj_01)
       (pred_1 obj_02 obj_03)
       (pred_1 obj_09 obj_04)
       (pred_1 obj_09 obj_18)
       (pred_1 obj_09 obj_14)
       (pred_1 obj_18 obj_05)
       (pred_1 obj_18 obj_13)
       (pred_1 obj_18 obj_10)
       (pred_1 obj_18 obj_09)
       (pred_1 obj_13 obj_07)
       (pred_1 obj_13 obj_01)
       (pred_1 obj_13 obj_03)
       (pred_1 obj_13 obj_18)
       (pred_1 obj_01 obj_08)
       (pred_1 obj_01 obj_02)
       (pred_1 obj_01 obj_13)
       (pred_1 obj_04 obj_22)
       (pred_1 obj_04 obj_05)
       (pred_1 obj_04 obj_09)
       (pred_1 obj_05 obj_19)
       (pred_1 obj_05 obj_07)
       (pred_1 obj_05 obj_18)
       (pred_1 obj_05 obj_04)
       (pred_1 obj_07 obj_16)
       (pred_1 obj_07 obj_08)
       (pred_1 obj_07 obj_13)
       (pred_1 obj_07 obj_05)
       (pred_1 obj_08 obj_21)
       (pred_1 obj_08 obj_01)
       (pred_1 obj_08 obj_07)
       (pred_1 obj_22 obj_19)
       (pred_1 obj_22 obj_04)
       (pred_1 obj_19 obj_16)
       (pred_1 obj_19 obj_05)
       (pred_1 obj_19 obj_22)
       (pred_1 obj_16 obj_21)
       (pred_1 obj_16 obj_07)
       (pred_1 obj_16 obj_19)
       (pred_1 obj_21 obj_08)
       (pred_1 obj_21 obj_16)
       (pred_8 obj_03)
       (pred_8 obj_05)
       (pred_8 obj_04)
       (pred_10  obj_03 obj_17)
       (pred_10  obj_05 obj_15)
       (pred_10  obj_04 obj_06)
       (pred_9 obj_14)
       (pred_9 obj_10)
       (pred_9 obj_02)
       (pred_9 obj_09)
       (pred_9 obj_18)
       (pred_9 obj_13)
       (pred_9 obj_01)
       (pred_9 obj_07)
       (pred_9 obj_08)
       (pred_9 obj_22)
       (pred_9 obj_19)
       (pred_9 obj_16)
       (pred_9 obj_21)

       (pred_11  obj_20 obj_17)
       (pred_11  obj_11 obj_15)
       (pred_11  obj_12 obj_06)
       (pred_5 obj_20 obj_09)
       (pred_5 obj_11 obj_18)
       (pred_5 obj_12 obj_19)
       (pred_4 obj_14)
    )

    (:goal (and
       (pred_5 obj_12 obj_09)
    ))
(:constraints
  (always (not (pred_4 obj_04)))
)
)

; plan
1. (op_5 obj_14 obj_09)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_09)
   goals met: 0 of 1
2. (op_5 obj_09 obj_18)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_18)
   goals met: 0 of 1
3. (op_1 obj_18 obj_11)
   deleted: (pred_5 obj_11 obj_18) (pred_3)
   added: (pred_6 obj_11)
   goals met: 0 of 1
4. (op_3 obj_18 obj_05 obj_11 obj_15)
   deleted: (pred_8 obj_05)
   added: (pred_9 obj_05)
   goals met: 0 of 1
5. (op_5 obj_18 obj_05)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_05)
   goals met: 0 of 1
6. (op_5 obj_05 obj_19)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_19)
   goals met: 0 of 1
7. (op_2 obj_19 obj_12 obj_11)
   deleted: (pred_6 obj_11) (pred_5 obj_12 obj_19)
   added: (pred_6 obj_12) (pred_5 obj_11 obj_19)
   goals met: 0 of 1
8. (op_5 obj_19 obj_05)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_05)
   goals met: 0 of 1
9. (op_5 obj_05 obj_18)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_18)
   goals met: 0 of 1
10. (op_5 obj_18 obj_09)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_09)
   goals met: 0 of 1
11. (op_2 obj_09 obj_20 obj_12)
   deleted: (pred_6 obj_12) (pred_5 obj_20 obj_09)
   added: (pred_6 obj_20) (pred_5 obj_12 obj_09)
   goals met: 1 of 1
